package _studentManage;

/*
 * # 성적관리 시스템 확장형
 * >> =성적관리_V1.0=
 * - 로그인이 필요합니다. 로그인 해주세요
 * - 아이디를 입력하세요>>
 * - 비밀번호를 입력하세요>>
 * $$ 관리자 아이디와 비밀번호 일 경우
 * 관리자 비밀번호는 admin / 1234로 고정하기
 * - 관리자님 환영합니다.
 * - = 1. 학생 관리 / 2. 학생 조회 =
 * - 할 일을 입력하세요>>
 * 1-1. 학생 관리를 시작합니다.
 * - = 1. 학생 추가 / 2. 학생 수정 / 3. 학생 제거 =
 * - 할 일을 입력하세요>>
 * 1-1-1. (학생 추가 메소드 실행)
 * 1-1-2. (학생 수정 메소드 실행)
 * 1-1-3. (학생 제거 메소드 실행)
 * 1-2. 학생 조회를 시작합니다.
 * - = 1. 학생 조회 / 2. 전체 조회 =
 * - 할 일을 입력하세요>>
 * 1-2-1. (단일 학생 조회 메소드 실행)
 * 1-2-2. (전체 학생 조회 메소드 실행)
 * $$ 학생 아이디와 비밀번호 일 경우
 * (사전에 학생아이디와 비밀번호는
 * std[ 학생번호 ] / 전화번호 뒷자리
 * 라고 고지하고, 만들어 놓은상태에서 시작하기 
 * - [학생이름]님 환영합니다.
 * - = 1. 학생 조회 =
 * - 할 일을 입력하세요>>
 * 1-1. 학생 조회를 시작합니다.
 * - (단일 학생 조회 메소드 실행)
 */

public class Student {

}
